Repository: mithun50/openclawd-termux
Catalog: flutter_app/lib/l10n/app_*.arb
Languages: ar, es, fr, hi, ja

# aiGateway
source: AI Gateway for Android
ar: بوابة الذكاء الاصطناعي لأندرويد
es: Puerta de enlace IA para Android
fr: Passerelle IA pour Android
hi: Android के लिए AI गेटवे
ja: Android用AIゲートウェイ

source: Loading...
ar: جارِ التحميل...
es: Cargando...
fr: Chargement...
hi: लोड हो रहा है...
ja: 読み込み中...

# checkingSetup
source: Checking setup status...
ar: جارِ التحقق من حالة الإعداد...
es: Verificando estado de configuración...
fr: Vérification de l'état de la configuration...
hi: सेटअप स्थिति जाँच रही है...
ja: セットアップ状態を確認中...

# setupTitle
source: Setup OpenClaw
ar: إعداد OpenClaw
es: Configurar OpenClaw
fr: Configurer OpenClaw
hi: OpenClaw सेटअप करें
ja: OpenClawをセットアップ

# setupDescription
source: This will download Ubuntu, Node.js, and OpenClaw into a self-contained environment.
ar: سيتم تنزيل Ubuntu و Node.js و OpenClaw في بيئة مستقلة.
es: Esto descargará Ubuntu, Node.js y OpenClaw en un entorno independiente.
fr: Cela téléchargera Ubuntu, Node.js et OpenClaw dans un environnement autonome.
hi: यह Ubuntu, Node.js और OpenClaw को एक स्वतंत्र वातावरण में डाउनलोड करेगा।
ja: Ubuntu、Node.js、OpenClawを独立した環境にダウンロードします。

# settingUpEnvironment
source: Setting up the environment. This may take several minutes.
ar: جارِ إعداد البيئة. قد يستغرق هذا عدة دقائق.
es: Configurando el entorno. Esto puede tardar varios minutos.
fr: Configuration de l'environnement. Cela peut prendre plusieurs minutes.
hi: वातावरण सेट हो रहा है। इसमें कई मिनट लग सकते हैं।
ja: 環境をセットアップ中です。数分かかる場合があります。

source: Begin Setup
ar: بدء الإعداد
es: Iniciar configuración
fr: Commencer la configuration
hi: सेटअप शुरू करें
ja: セットアップを開始

source: Retry Setup
ar: إعادة المحاولة
es: Reintentar configuración
fr: Réessayer la configuration
hi: पुनः प्रयास करें
ja: セットアップを再試行

source: Configure API Keys
ar: تكوين مفاتيح API
es: Configurar claves API
fr: Configurer les clés API
hi: API कुंजियाँ कॉन्फ़िगर करें
ja: APIキーを設定

# storageRequirement
source: Requires ~500MB of storage and an internet connection
ar: يتطلب ~500 ميجابايت من التخزين واتصال بالإنترنت
es: Requiere ~500MB de almacenamiento y conexión a internet
fr: Nécessite ~500 Mo de stockage et une connexion Internet
hi: ~500MB स्टोरेज और इंटरनेट कनेक्शन आवश्यक है
ja: 約500MBのストレージとインターネット接続が必要です

source: Unknown error
ar: خطأ غير معروف
es: Error desconocido
fr: Erreur inconnue
hi: अज्ञात त्रुटि
ja: 不明なエラー

# stepDownloadRootfs
source: Download Ubuntu rootfs
ar: تنزيل Ubuntu rootfs
es: Descargar Ubuntu rootfs
fr: Télécharger Ubuntu rootfs
hi: Ubuntu rootfs डाउनलोड करें
ja: Ubuntu rootfsをダウンロード

# stepExtractRootfs
source: Extract rootfs
ar: استخراج rootfs
es: Extraer rootfs
fr: Extraire rootfs
hi: Rootfs निकालें
ja: rootfsを展開

# stepInstallNode
source: Install Node.js
ar: تثبيت Node.js
es: Instalar Node.js
fr: Installer Node.js
hi: Node.js इंस्टॉल करें
ja: Node.jsをインストール

# stepInstallOpenClaw
source: Install OpenClaw
ar: تثبيت OpenClaw
es: Instalar OpenClaw
fr: Installer OpenClaw
hi: OpenClaw इंस्टॉल करें
ja: OpenClawをインストール

# stepConfigureBypass
source: Configure Bionic Bypass
ar: تكوين Bionic Bypass
es: Configurar Bionic Bypass
fr: Configurer Bionic Bypass
hi: Bionic Bypass कॉन्फ़िगर करें
ja: Bionic Bypassを設定

source: Setup complete!
ar: اكتمل الإعداد!
es: ¡Configuración completa!
fr: Configuration terminée !
hi: सेटअप पूरा हुआ!
ja: セットアップ完了！

source: Quick Actions
ar: إجراءات سريعة
es: Acciones rápidas
fr: Actions rapides
hi: त्वरित कार्रवाई
ja: クイックアクション

source: Terminal
ar: الطرفية
hi: टर्मिनल
ja: ターミナル

# terminalSubtitle
source: Open Ubuntu shell with OpenClaw
ar: افتح واجهة Ubuntu مع OpenClaw
es: Abrir shell Ubuntu con OpenClaw
fr: Ouvrir le shell Ubuntu avec OpenClaw
hi: OpenClaw के साथ Ubuntu शेल खोलें
ja: OpenClaw付きUbuntuシェルを開く

source: Web Dashboard
ar: لوحة التحكم
es: Panel web
fr: Tableau de bord web
hi: वेब डैशबोर्ड
ja: Webダッシュボード

# webDashboardSubtitleRunning
source: Open OpenClaw dashboard in browser
ar: افتح لوحة تحكم OpenClaw في المتصفح
es: Abrir panel de OpenClaw en el navegador
fr: Ouvrir le tableau de bord OpenClaw dans le navigateur
hi: OpenClaw डैशबोर्ड ब्राउज़र में खोलें
ja: ブラウザでOpenClawダッシュボードを開く

source: Start gateway first
ar: ابدأ البوابة أولاً
es: Inicie la puerta de enlace primero
fr: Démarrez d'abord la passerelle
hi: पहले गेटवे शुरू करें
ja: 先にゲートウェイを起動してください

source: Onboarding
ar: الإعداد الأولي
es: Incorporación
fr: Intégration
hi: ऑनबोर्डिंग
ja: オンボーディング

# onboardingSubtitle
source: Configure API keys and binding
ar: تكوين مفاتيح API والربط
es: Configurar claves API y vinculación
fr: Configurer les clés API et la liaison
hi: API कुंजियाँ और बाइंडिंग कॉन्फ़िगर करें
ja: APIキーとバインディングを設定

source: Logs
ar: السجلات
es: Registros
fr: Journaux
hi: लॉग्स
ja: ログ

# logsSubtitle
source: View gateway output and errors
ar: عرض مخرجات البوابة والأخطاء
es: Ver salida y errores de la puerta de enlace
fr: Voir la sortie et les erreurs de la passerelle
hi: गेटवे आउटपुट और त्रुटियाँ देखें
ja: ゲートウェイの出力とエラーを表示

# byLine
source: by {author} | {org}
ar: بواسطة {author} | {org}
es: por {author} | {org}
fr: par {author} | {org}
hi: {author} द्वारा | {org}
ja: {author} | {org}

# terminalTitle
source: Terminal
ar: الطرفية
hi: टर्मिनल
ja: ターミナル

source: Starting terminal...
ar: جارِ بدء الطرفية...
es: Iniciando terminal...
fr: Démarrage du terminal...
hi: टर्मिनल शुरू हो रहा है...
ja: ターミナルを起動中...

# failedToStartTerminal
source: Failed to start terminal: {error}
ar: فشل بدء الطرفية: {error}
es: Error al iniciar terminal: {error}
fr: Échec du démarrage du terminal : {error}
hi: टर्मिनल शुरू करने में विफल: {error}
ja: ターミナルの起動に失敗: {error}

source: Open Link
ar: فتح الرابط
es: Abrir enlace
fr: Ouvrir le lien
hi: लिंक खोलें
ja: リンクを開く

source: Cancel
ar: إلغاء
es: Cancelar
fr: Annuler
hi: रद्द करें
ja: キャンセル

source: Copy
ar: نسخ
es: Copiar
fr: Copier
hi: कॉपी
ja: コピー

source: Open
ar: فتح
es: Abrir
fr: Ouvrir
hi: खोलें
ja: 開く

source: Paste
ar: لصق
es: Pegar
fr: Coller
hi: पेस्ट
ja: 貼り付け

source: Restart
ar: إعادة التشغيل
es: Reiniciar
fr: Redémarrer
hi: पुनः आरंभ
ja: 再起動

source: Copied to clipboard
ar: تم النسخ إلى الحافظة
es: Copiado al portapapeles
fr: Copié dans le presse-papiers
hi: क्लिपबोर्ड पर कॉपी किया गया
ja: クリップボードにコピーしました

source: Link copied
ar: تم نسخ الرابط
es: Enlace copiado
fr: Lien copié
hi: लिंक कॉपी किया गया
ja: リンクをコピーしました

# noUrlFound
source: No URL found in selection
ar: لم يتم العثور على URL في التحديد
es: No se encontró URL en la selección
fr: Aucune URL trouvée dans la sélection
hi: चयन में कोई URL नहीं मिला
ja: 選択範囲にURLが見つかりません

# copyTooltip
source: Copy
ar: نسخ
es: Copiar
fr: Copier
hi: कॉपी
ja: コピー

# openUrlTooltip
source: Open URL
ar: فتح URL
es: Abrir URL
fr: Ouvrir l'URL
hi: URL खोलें
ja: URLを開く

# pasteTooltip
source: Paste
ar: لصق
es: Pegar
fr: Coller
hi: पेस्ट
ja: 貼り付け

# restartTooltip
source: Restart
ar: إعادة التشغيل
es: Reiniciar
fr: Redémarrer
hi: पुनः आरंभ
ja: 再起動

# processExited
source: Process exited with code {code}
ar: انتهت العملية برمز {code}
es: El proceso finalizó con código {code}
fr: Le processus s'est terminé avec le code {code}
hi: प्रक्रिया कोड {code} के साथ समाप्त हुई
ja: プロセスがコード{code}で終了しました

# webDashboardTitle
source: Web Dashboard
ar: لوحة التحكم
es: Panel web
fr: Tableau de bord web
hi: वेब डैशबोर्ड
ja: Webダッシュボード

# failedToLoadDashboard
source: Failed to load dashboard: {error}
ar: فشل تحميل لوحة التحكم: {error}
es: Error al cargar el panel: {error}
fr: Échec du chargement du tableau de bord : {error}
hi: डैशबोर्ड लोड करने में विफल: {error}
ja: ダッシュボードの読み込みに失敗: {error}

source: Retry
ar: إعادة المحاولة
es: Reintentar
fr: Réessayer
hi: पुनः प्रयास
ja: 再試行

source: Gateway Logs
ar: سجلات البوابة
es: Registros de puerta de enlace
fr: Journaux de la passerelle
hi: गेटवे लॉग्स
ja: ゲートウェイログ

source: Filter logs...
ar: تصفية السجلات...
es: Filtrar registros...
fr: Filtrer les journaux...
hi: लॉग्स फ़िल्टर करें...
ja: ログをフィルター...

source: Copy all logs
ar: نسخ جميع السجلات
es: Copiar todos los registros
fr: Copier tous les journaux
hi: सभी लॉग्स कॉपी करें
ja: すべてのログをコピー

source: Auto-scroll on
ar: التمرير التلقائي مفعّل
es: Auto-desplazamiento activado
fr: Défilement auto activé
hi: ऑटो-स्क्रॉल चालू
ja: 自動スクロール オン

source: Auto-scroll off
ar: التمرير التلقائي معطّل
es: Auto-desplazamiento desactivado
fr: Défilement auto désactivé
hi: ऑटो-स्क्रॉल बंद
ja: 自動スクロール オフ

# noLogsYet
source: No logs yet. Start the gateway.
ar: لا توجد سجلات بعد. ابدأ البوابة.
es: Sin registros aún. Inicie la puerta de enlace.
fr: Aucun journal. Démarrez la passerelle.
hi: अभी कोई लॉग नहीं। गेटवे शुरू करें।
ja: ログがありません。ゲートウェイを起動してください。

source: No matching logs.
ar: لا توجد سجلات مطابقة.
es: No hay registros coincidentes.
fr: Aucun journal correspondant.
hi: कोई मिलते जुलते लॉग नहीं।
ja: 一致するログがありません。

# logsCopied
source: Logs copied to clipboard
ar: تم نسخ السجلات إلى الحافظة
es: Registros copiados al portapapeles
fr: Journaux copiés dans le presse-papiers
hi: लॉग्स क्लिपबोर्ड पर कॉपी किए गए
ja: ログをクリップボードにコピーしました

# onboardingTitle
source: OpenClaw Onboarding
ar: الإعداد الأولي لـ OpenClaw
es: Incorporación de OpenClaw
fr: Intégration OpenClaw
hi: OpenClaw ऑनबोर्डिंग
ja: OpenClaw オンボーディング

source: Starting onboarding...
ar: جارِ بدء الإعداد الأولي...
es: Iniciando incorporación...
fr: Démarrage de l'intégration...
hi: ऑनबोर्डिंग शुरू हो रही है...
ja: オンボーディングを開始中...

source: Go to Dashboard
ar: الذهاب إلى لوحة التحكم
es: Ir al panel
fr: Aller au tableau de bord
hi: डैशबोर्ड पर जाएँ
ja: ダッシュボードへ

source: Done
ar: تم
es: Listo
fr: Terminé
hi: पूरा हुआ
ja: 完了

# onboardingError
source: Onboarding encountered an error. Check the terminal output above.
ar: واجه الإعداد الأولي خطأً. تحقق من مخرجات الطرفية أعلاه.
es: La incorporación encontró un error. Verifique la salida del terminal arriba.
fr: L'intégration a rencontré une erreur. Vérifiez la sortie du terminal ci-dessus.
hi: ऑनबोर्डिंग में त्रुटि हुई। ऊपर टर्मिनल आउटपुट जाँचें।
ja: オンボーディングでエラーが発生しました。上のターミナル出力を確認してください。

source: Settings
ar: الإعدادات
es: Ajustes
fr: Paramètres
hi: सेटिंग्स
ja: 設定

source: General
ar: عام
fr: Général
hi: सामान्य
ja: 一般

source: Auto-start gateway
ar: تشغيل البوابة تلقائياً
es: Inicio automático de puerta de enlace
fr: Démarrage auto de la passerelle
hi: गेटवे ऑटो-स्टार्ट
ja: ゲートウェイ自動起動

# autoStartSubtitle
source: Start the gateway when the app opens
ar: بدء البوابة عند فتح التطبيق
es: Iniciar la puerta de enlace al abrir la aplicación
fr: Démarrer la passerelle à l'ouverture de l'application
hi: ऐप खुलने पर गेटवे शुरू करें
ja: アプリ起動時にゲートウェイを開始

source: Battery Optimization
ar: تحسين البطارية
es: Optimización de batería
fr: Optimisation de la batterie
hi: बैटरी ऑप्टिमाइज़ेशन
ja: バッテリー最適化

# batteryOptimized
source: Optimized (may kill background sessions)
ar: محسّنة (قد تُنهي الجلسات في الخلفية)
es: Optimizada (puede cerrar sesiones en segundo plano)
fr: Optimisée (peut arrêter les sessions en arrière-plan)
hi: ऑप्टिमाइज़्ड (बैकग्राउंड सेशन बंद हो सकते हैं)
ja: 最適化済み（バックグラウンドセッションが終了する可能性）

# batteryUnrestricted
source: Unrestricted (recommended)
ar: بدون قيود (موصى به)
es: Sin restricciones (recomendado)
fr: Sans restriction (recommandé)
hi: अप्रतिबंधित (अनुशंसित)
ja: 制限なし（推奨）

source: System Info
ar: معلومات النظام
es: Información del sistema
fr: Infos système
hi: सिस्टम जानकारी
ja: システム情報

source: Architecture
ar: البنية
es: Arquitectura
hi: आर्किटेक्चर
ja: アーキテクチャ

source: PRoot path
ar: مسار PRoot
es: Ruta PRoot
fr: Chemin PRoot
hi: PRoot पथ
ja: PRootパス

source: Installed
ar: مثبّت
es: Instalado
fr: Installé
hi: इंस्टॉल है
ja: インストール済み

source: Not installed
ar: غير مثبّت
es: No instalado
fr: Non installé
hi: इंस्टॉल नहीं है
ja: 未インストール

source: Maintenance
ar: الصيانة
es: Mantenimiento
hi: रखरखाव
ja: メンテナンス

source: Re-run setup
ar: إعادة تشغيل الإعداد
es: Ejecutar configuración de nuevo
fr: Relancer la configuration
hi: सेटअप फिर से चलाएँ
ja: セットアップを再実行

# rerunSubtitle
source: Reinstall or repair the environment
ar: إعادة تثبيت أو إصلاح البيئة
es: Reinstalar o reparar el entorno
fr: Réinstaller ou réparer l'environnement
hi: वातावरण पुनः इंस्टॉल या मरम्मत करें
ja: 環境を再インストールまたは修復

source: About
ar: حول
es: Acerca de
fr: À propos
hi: बारे में
ja: アプリについて

# aiGatewayVersion
source: AI Gateway for Android Version {version}
ar: بوابة الذكاء الاصطناعي لأندرويد الإصدار {version}
es: Puerta de enlace IA para Android Versión {version}
fr: Passerelle IA pour Android Version {version}
hi: Android के लिए AI गेटवे संस्करण {version}
ja: Android用AIゲートウェイ バージョン {version}

source: Developer
ar: المطوّر
es: Desarrollador
fr: Développeur
hi: डेवलपर
ja: 開発者

source: License
ar: الترخيص
es: Licencia
fr: Licence
hi: लाइसेंस
ja: ライセンス

source: Contact
ar: اتصل بنا
es: Contacto
hi: संपर्क
ja: 連絡先

source: Email
ar: البريد الإلكتروني
es: Correo electrónico
hi: ईमेल
ja: メール

source: Start Gateway
ar: بدء البوابة
es: Iniciar puerta de enlace
fr: Démarrer la passerelle
hi: गेटवे शुरू करें
ja: ゲートウェイを起動

source: Stop Gateway
ar: إيقاف البوابة
es: Detener puerta de enlace
fr: Arrêter la passerelle
hi: गेटवे बंद करें
ja: ゲートウェイを停止

source: View Logs
ar: عرض السجلات
es: Ver registros
fr: Voir les journaux
hi: लॉग्स देखें
ja: ログを表示

# urlCopied
source: URL copied to clipboard
ar: تم نسخ URL إلى الحافظة
es: URL copiada al portapapeles
fr: URL copiée dans le presse-papiers
hi: URL क्लिपबोर्ड पर कॉपी किया गया
ja: URLをクリップボードにコピーしました

# gatewayRunning
source: Running on port {port}
ar: يعمل على المنفذ {port}
es: Ejecutándose en el puerto {port}
fr: En cours d'exécution sur le port {port}
hi: पोर्ट {port} पर चल रहा है
ja: ポート{port}で実行中

# gatewayStopped
source: Gateway is stopped
ar: البوابة متوقفة
es: Puerta de enlace detenida
fr: Passerelle arrêtée
hi: गेटवे बंद है
ja: ゲートウェイは停止中

# gatewayStarting
source: Starting...
ar: جارِ البدء...
es: Iniciando...
fr: Démarrage...
hi: शुरू हो रहा है...
ja: 起動中...

# gatewayError
source: Error
ar: خطأ
fr: Erreur
hi: त्रुटि
ja: エラー
